src/AccumulationRegisters/РасчетыСПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПерсоналом</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РасчетыСПерсоналом/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Получить таблицу задолженности организации перед персоналом по указанному месяцу начисления и СЕ
Функция ПолучитьТаблицуЗадолженностиПередПерсоналом(РасчетныйМесяц = Неопределено,ДокументНачисления = Неопределено,СтруктурнаяЕдиница = Неопределено,Период = Неопределено,ИсключатьРегистратор = Неопределено) Экспорт

	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.ДокументНачисления КАК ДокументОснования
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПерсоналомОбороты.Сотрудник КАК Сотрудник,
	|		РасчетыСПерсоналомОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		СУММА(РасчетыСПерсоналомОбороты.СуммаОборот) КАК Сумма,
	|		РасчетыСПерсоналомОбороты.ДокументНачисления КАК ДокументНачисления
	|	ИЗ
	|		РегистрНакопления.РасчетыСПерсоналом.Обороты(
	|				,
	|				&Период,
	|				Авто,
	|				ВЫБОР
	|						КОГДА НЕ &МесяцНачисления = НЕОПРЕДЕЛЕНО
	|							ТОГДА МесяцНачисления = &МесяцНачисления
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА НЕ &ДокументНачисления = НЕОПРЕДЕЛЕНО
	|							ТОГДА ДокументНачисления = &ДокументНачисления
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|							ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК РасчетыСПерсоналомОбороты
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА НЕ &ИсключатьРегистратор = НЕОПРЕДЕЛЕНО
	|					ТОГДА НЕ РасчетыСПерсоналомОбороты.Регистратор = &ИсключатьРегистратор
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыСПерсоналомОбороты.Сотрудник,
	|		РасчетыСПерсоналомОбороты.СтруктурнаяЕдиница,
	|		РасчетыСПерсоналомОбороты.ДокументНачисления) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Сумма > 0");
	
	ЗапросВыборка.УстановитьПараметр("МесяцНачисления"     ,?(ЗначениеЗаполнено(РасчетныйМесяц),НачалоМесяца(РасчетныйМесяц),Неопределено));
	ЗапросВыборка.УстановитьПараметр("ДокументНачисления"  ,ДокументНачисления);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница"  ,СтруктурнаяЕдиница);
	ЗапросВыборка.УстановитьПараметр("Период"              ,?(Период = Неопределено,Дата(0001,01,01,0,0,0),Период));
	ЗапросВыборка.УстановитьПараметр("ИсключатьРегистратор",ИсключатьРегистратор);
	
	Возврат ЗапросВыборка.Выполнить().Выгрузить();
	
КонецФункции	

#КонецОбласти
